# -*- coding: utf-8 -*-


#URL中的关键词
curl_keywords = [
	"sale","daddy","dcoin","aliyun",
	"amazon","alibaba",
	"ename","404","jumi","cdn",
	"aws","juming","tuiyu",
	"yuming","hugedomain","mi."
]

#页面源代码中的关键词
page_keywords = [
	"this domain","for sale","08123",
	"renew","parking","yuming","bidemi",
	"the domain you visiting","transfer",
	"议价","询价","报价",
	"到期","赎回","续费","抢注","域名出售",
	"失效域名","转让","所有权","域名转移",
	"购买域名","售卖中","转让出售","soumi",
	"购买该域名","正在出售","过期域名","竞价",
	"注册商","外链","反链","数字域名","品牌域名",
	"精品域名","代价","好的域名","米表","域名代购"
]


#非法域名（色情/赌博)关键词
malicous_keywords = ['三和红姐', '三平特三连', 
	'三级片', '世家', '丝袜', '丝袜美腿', '中彩', 
	'中彩堂', '中特', '中特平', '中特平特', '中特平特三连', '中超', '中马堂', 
	'久久', '乐博', '乐坊', '乐彩', '乐虎', '九肖', '乱伦', '互博', 
	'五码', '五福临门', '亚盘', '亚视', '人妻', '众彩', 
	'优博', '伦理', '做爱', '做爱图', '偷偷', '偷拍', '免费成人', 
	'免费电影', '免费视频', '八码', '八肖九肖', '六合', '六合区', '六合彩', 
	'六合拳', '六合网', '六和彩', '六彩', '六码', '六肖', '六肖中特', '写真', 
	'分分彩', '分彩', '动作片', '博久', '博乐', '博会', '博体', '博华', 
	'博发', '博官', '博彩', '博心', '博点', '博球网', '博码', '博线', '博馬', 
	'双彩', '双色球', '发牌', '合买', '合彩', '合集', '同乐', '咪咪', '品特', 
	'哥也色', '哥哥', '哥哥妹妹', '哥要', '噜噜色', '四码', '四肖',
	'圣淘沙', '在线播放', '在线视频', '坏蛋', '坛主', '城码', 
	'多宝鱼', '大色', '大色堂', '大色妹', '大色网', '大色鱼', '大赢家', 
	'太阳城', '奇艺色', '女优', '奶奶', '好料', 
	'姿彩', '威尼斯人', '娛樂城', 
	'娛樂場','娱乐场', '娱乐城', '婷婷', '富网', '射哥', 
	'射夜', '射射', '射影', '射猫', '射精', '射网',
	'小色', '小色哥', '小赌', '小龙女', '少妇', '屌丝', '岛国', '岛弟', 
	'巨乳', '干妈', '干色', '平买', '平坛', '平注', '平码', '平肖', 
	'平肖平码', '庞博','开奖号码', '开彩', '开浆', '开码', 
	'开马', '强奸', '彩乐点', '彩人', '彩合尾', '彩圣网', '彩址', '彩坛', 
	'彩堂', '彩官', '彩客', '彩富', '彩富网', '彩心', '彩报', '彩民', '彩特彩', '彩特码', 
	'彩盘', '彩票', '彩票网', '彩票论坛', '彩赢', '彩霸王','心水', 
	'心水坛', '心水论', '心经', '快播', '性交', '性姿势', '性技巧', '性校', '性爱', 
	'性爱网', '性生活', '恋夜', '恋母',
	'意甲', '成人', '成人级', '成人网', '房播播色', '房播色', '扑克', '抓码',
	'投注站', '投注网', '护民', '报喜鸟', '报码', '报码室', '报碼', '报网', '拉马',
	'拳彩', '拼码', '挂牌', '推牌九', '插妹', '插穴','摇奖机', 
	 '播播', '播播色', '撸', '撸之', '撸你妹', '撸俺', '撸哥', '撸啦色', 
	'撸夜', '撸大', '撸大色', '撸奇', '撸射', '撸得', '撸得得', '撸恩恩', '撸我', '撸撸', 
	'撸日', '撸狠', '撸看', '撸管', '撸网', '撸色', '撸额', '撸鸟', '操操', '操色', '救世', 
	'救世报', '斗地主', '新番', '新码', '无忧', '无敌', '无玛亚州', '无码', '日加',
	'日博', '日日','时彩','易胜博', '星博','曾道人', '视讯', '谷神',
	'期特码', '杏彩', '桃色', '欧博','欲望', '毛片', '水主', '水坛', '水心',
	'永平', '波波', '波盘', '波肖门', '波肖门尾', '注数', '洪金宝', '淘码', '淫乱', 
	'淫妻', '淫民', '淫淫', '淫淫网', '淫色', '淫香', '清纯', '港彩', '港码', '港龙', 
	'源码', '澳博', '澳盘', '熟女', '爱爱', '爱色', '爱色堂', 
	'牌九', '牌照', '牛彩', '牛牛', '特供', '特区', '特围', '特图', '特平', '特平码', '特彩', 
	'特报', '特料', '特特码', '特码', '特码王', '特码诗', '特论', '特马', '状元红', '狠狠', 
	'猛料', '猪哥', '玄机', '玄码', '玄网', '王中王', '环亚', '球探网', '球王', '球网', 
	'生肖', '生财有道', '申博', '白姐', '白小姐', '白金', '百佬汇', '百合', '百家乐', 
	'看码', '真人', '码会', '码友', '码型', '码室', '码平', '码彩', '码心', '码报', '码特码', 
	'码王', '码皇', '码神', '神彩', '神彩堂', '神码', '神童', '神算', '福临门', '福利彩票', 
	'福坛', '福彩', '稳赚', '稳赢', '立博', '竞彩', '第四色', '红姐', '红港', 
	'红足', '网博码', '网合彩', '网四房', '网彩', '网插', '网白姐', '美乳', 
	'美女', '美腿', '群官', '群英', '老色', '老虎机', '老金','肉感', '肖准', 
	'胆码', '自拍', '色乳', '色人阁', '色原', '色咪咪', '色哥', '色图', 
	'色堂', '色夜', '色妹妹', '色导', '色情', '色情网', '色情网站', '色播', '色播播', 
	'色播色', '色播鲁', '色欲', '色涩', '色片', '色男', '色站', '色网', '色色', '色色播', 
	'色色片', '色色色', '色鱼', '花花公子', '苍井', '草色', '荷官', '菲彩', '菲律宾', 
	'萝莉', '葡京', '蕾丝', '虎坛', '虹姐', '蜜桃', '蝴蝶梦', '蝴蝶谷', '蝶谷', '裸体', 
	'购彩', '资料', '赌侠', '赌博', '赌圣', '赌场', '赌坊', '赌坛', '赌城', '赌王', '赌球', 
	'赌神', '赌经', '赌船', '赌霸', '赔率', '赛车', '赢彩', '赢球', '赢钱', '超清', '超碰', 
	'足球博彩', '足球彩票', '轮盘', '透码', '透透', '通博', '通宝', '速博', '運彩', '道人', 
	'邪恶', '金冠', '金多宝', '金宝博', '金彩', '金沙', '金港', '金牛', '金界', '金码', '金童', 
	'金花', '金鸡', '金龍', '铁算盘', '长胜平特', '长胜平特水', '门户网站', '阴毛', 
	'降龙士', '限制级','顶尖高手', '频道','香特', '香蕉', '馬會', '马会', 
	'马会网', '马报', '马牌', '马经', '骚穴', '骰宝', '高手', '高清', '鹰坛', '麻将', '黄大仙', 
	'黄色', '黄色图片', '黄色电影', '黄页', '龙博', '龙坛', '龙虎']











